{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "model_type": "llama",
  "vocab_size": 32000,
  "hidden_size": 4096,
  "intermediate_size": 11008,
  "num_hidden_layers": 32,
  "num_attention_heads": 32,
  "num_key_value_heads": 32,
  "max_position_embeddings": 2048,
  "rms_norm_eps": 1e-06,
  "initializer_range": 0.02,
  "use_cache": true,
  "tie_word_embeddings": false,
  "rope_theta": 10000.0,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "_name_or_path": "mock-model"
}